openfoam/run/backwardStep_parabolic_re1000_linearUpwind/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       32340;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       32360;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          860;
        startFace       32400;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          32800;
        startFace       33260;
    }
)

// ************************************************************************* //
