openfoam/run/backwardStep_parabolic_re1000_linearUpwind/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
inlet
{
    type codedFixedValue;
    value uniform (1 0 0);
    name parabolicInlet;

    code
    #{
        const vectorField& Cf = patch().Cf();
        vectorField& U = *this;

        const scalar y0   = 0.1;   // bottom of inlet (meters)
        const scalar H    = 0.1;   // inlet height (meters) = 1.0*convertToMeters
        const scalar Ubar = 1.0;   // desired MEAN inlet velocity

        forAll(Cf, faceI)
        {
            scalar y = Cf[faceI].y() - y0;                // y in [0,H]
            scalar Ux = 6.0*Ubar*(y*(H - y))/(H*H);       // mean(Ux)=Ubar
            U[faceI] = vector(Ux, 0, 0);
        }
    #};
}


    outlet { type zeroGradient; }
    walls { type noSlip; }
    frontAndBack { type empty; }
}
